УТ_для_edt.РасширениеСмарт/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>БезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/CommonModules/УчетНДСУП/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("СтавкаНДСПоУмолчанию")
//++ #Б-5568 смарт: Фролов 03.02.2026 //Ставка НДС в документах "Поступление ДС " справить с 20 на 22 %.
Функция смарт_СтавкаНДСПоУмолчанию(Дата, РасчетнаяСтавка, НалогообложениеНДС)

	ДатаПолучения = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	#Вставка
	Если ДатаПолучения >= '20260101' Тогда
		Возврат ?(РасчетнаяСтавка, Перечисления.СтавкиНДС.НДС22_122, Перечисления.СтавкиНДС.НДС22);
	ИначеЕсли ДатаПолучения >= '20190101' Тогда
		Возврат ?(РасчетнаяСтавка, Перечисления.СтавкиНДС.НДС20_120, Перечисления.СтавкиНДС.НДС20);
	Иначе
		Возврат ?(РасчетнаяСтавка, Перечисления.СтавкиНДС.НДС18_118, Перечисления.СтавкиНДС.НДС18);
	КонецЕсли;
	#КонецВставки
	
	#Удаление
	Если ДатаПолучения >= '20190101' Тогда
		Возврат ?(РасчетнаяСтавка, Перечисления.СтавкиНДС.НДС20_120, Перечисления.СтавкиНДС.НДС20);
	Иначе
		Возврат ?(РасчетнаяСтавка, Перечисления.СтавкиНДС.НДС18_118, Перечисления.СтавкиНДС.НДС18);
	КонецЕсли;
	#КонецУдаления

КонецФункции //-- #Б-5568 смарт: Фролов 03.02.2026

#КонецОбласти

//#Область ПеренесеноСДоработками
//	
//&Вместо("ОтразитьПриобретениеУПоставщика")
//Процедура смарт_ОтразитьПриобретениеУПоставщика(Запрос, ТекстыЗапроса, Регистры, ТекстЦенности)
//	
//	//++ Локализация
//	Запрос.УстановитьПараметр("ТипыНалогообложенияНДСУчитываетсяВСтоимости", УчетНДСУПСлужебный.ТипыНалогообложенияНДСУчитываетсяВСтоимости());
//	Запрос.УстановитьПараметр("ТипыЗапасовСобственные", УчетНДСУПСлужебный.ТипыЗапасовСобственные());
//	Запрос.УстановитьПараметр("ТипыНоменклатурыТовар", УчетНДСУПСлужебный.ТипыНоменклатурыТовар());
//	Запрос.УстановитьПараметр("ДатаНачалаУчетаНДСПоНаправлениямДеятельности", УчетНДСУП.НастройкиУчета().ДатаНачалаУчетаНДСПоНаправлениямДеятельности);
//	Запрос.УстановитьПараметр("УправленческийУчетОрганизаций", УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.УправленческийУчетОрганизаций(Запрос.Параметры.Период));
//	
//#Область НДСПредъявленный
//	
//	ТекстЗапросаНДСПредъявленный = 
//	"ВЫБРАТЬ
//	|	Ценности.Ссылка КАК Регистратор,
//	|	Ценности.Период КАК Период,
//	|	Ценности.Организация КАК Организация,
//	|	ВЫБОР
//	|		КОГДА Ценности.КорректировкаПоСогласованиюСторон
//	|			ТОГДА Ценности.ДокументКорректировкиПриобретения
//	|		ИНАЧЕ Ценности.ДокументПриобретения
//	|	КОНЕЦ КАК СчетФактура,
//	|	Ценности.Контрагент КАК Поставщик,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (&ТипыНоменклатурыТовар)
//	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.ГруппаФинансовогоУчета.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары))
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА СтатьиРасходов.ВидЦенностиНДС
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
//	|	КОНЕЦ                                                             КАК ВидЦенности,
//	|	Ценности.СтавкаНДС                                                КАК СтавкаНДС,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (&ТипыНоменклатурыТовар, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(Назначения.ВидДеятельностиНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
//	|						ТОГДА Назначения.ВидДеятельностиНДС
//	|					КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ 
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL И СтатьиРасходов.ВариантРаспределенияРасходовРегл <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров) 
//	|			ТОГДА 
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВидЦенностиНДС, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС),
//	|						                                                           ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА))
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
//	|					КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					      И Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		ИНАЧЕ 
//	|			ВЫБОР
//	|				КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|					  И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|				ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|			КОНЕЦ
//	|	КОНЕЦ КАК ВидДеятельностиНДС,
//	|	ВЫБОР
//	|		КОГДА Ценности.ИсправлениеОшибок 
//	|			ТОГДА Ценности.ДокументКорректировкиПриобретения
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК ИсправленныйСчетФактура,
//	|	НЕОПРЕДЕЛЕНО КАК РеализацияЭкспорт,
//	|	ВЫБОР
//	|		КОГДА Ценности.Период >= &ДатаНачалаУчетаНДСПоНаправлениямДеятельности
//	|			ТОГДА ВЫБОР КОГДА ЕСТЬNULL(Назначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
//	|					ТОГДА Назначения.НаправлениеДеятельности
//	|					ИНАЧЕ Ценности.НаправлениеДеятельности
//	|				КОНЕЦ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК НаправлениеДеятельности,
//	|
//	|	ВЫБОР
//	|		КОГДА СуммыДокументов.БазаНДСРегл <> 0
//	|			ТОГДА СуммыДокументов.БазаНДСРегл
//	|		ИНАЧЕ СуммыДокументов.СуммаБезНДСРегл
//	|	КОНЕЦ КАК СуммаБезНДС,
//	|	СуммыДокументов.СуммаНДСРегл КАК НДС,
//	|	ВЫБОР
//	|		КОГДА &УправленческийУчетОрганизаций
//	//Фролов ++ //Изменен запрос, чтобы корректно заполнялись поля в регистрах при проведении документов. Проблема с полем НДС(упр)
//	|			//ТОГДА СуммыДокументов.СуммаНДСУпр
//	|			ТОГДА ВЫБОР КОГДА ЕСТЬNULL(СуммыДокументов.СуммаНДСУпр, 0) = 0 ТОГДА СуммыДокументов.СуммаНДСРегл * &КоэффициентПересчетаВВалютуУПР КОНЕЦ
//	//Фролов --
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК НДСУпр,
//	|
//	|	ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.ПустаяСсылка) КАК Событие,
//	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК КорВидДеятельностиНДС,
//	|	Ценности.ИдентификаторСтроки КАК ИдентификаторСтроки,
//	|	ЛОЖЬ КАК РегламентнаяОперация,
//	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
//	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК КорНаправлениеДеятельности,
//	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
//	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов
//	|ИЗ
//	|	#Ценности КАК Ценности
//	|	ЛЕВОЕ СОЕДИНЕНИЕ 
//	|		Справочник.Номенклатура КАК СпрНоменклатура
//	|	ПО 
//	|		Ценности.Номенклатура = СпрНоменклатура.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
//	|	ПО
//	|		Ценности.СтатьяРасходов = СтатьиРасходов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
//	|	ПО
//	|		Ценности.СтатьяПрочихАктивов = СтатьиАктивовПассивов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.ВидыЗапасов КАК СпрВидыЗапасов
//	|	ПО
//	|		Ценности.Номенклатура = СпрВидыЗапасов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.Назначения КАК Назначения
//	|	ПО
//	|		Ценности.Назначение = Назначения.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ВтСуммыДокументовВВалютахУчета КАК СуммыДокументов
//	|	ПО
//	|		Ценности.Ссылка = СуммыДокументов.Ссылка
//	|		И Ценности.ИдентификаторСтроки = СуммыДокументов.ИдентификаторСтроки
//	|
//	|ГДЕ
//	|	Ценности.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
//	|	И НЕ ВЫБОР
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (&ТипыНоменклатурыТовар, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(Назначения.ВидДеятельностиНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
//	|						ТОГДА Назначения.ВидДеятельностиНДС
//	|					КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL И СтатьиРасходов.ВариантРаспределенияРасходовРегл <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВидЦенностиНДС, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС),
//	|						                                                           ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА))
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
//	|					КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					      И Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		ИНАЧЕ
//	|			ВЫБОР
//	|				КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|					  И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|				ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|			КОНЕЦ
//	|	КОНЕЦ В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
//	|	И ЕСТЬNULL(СуммыДокументов.СуммаНДСРегл, 0) <> 0
//	|";
//	
//#КонецОбласти
//	
//#Область ПартииПрочихРасходов
//	
//	ТекстЗапросаПартииПрочихРасходов =
//	// Формирование движений по распределяемым расходам
//	"ВЫБРАТЬ
//	|	Ценности.Ссылка КАК Регистратор,
//	|	Ценности.Период КАК Период,
//	|	Ценности.Организация КАК Организация,
//	|	Ценности.ПодразделениеУчета КАК Подразделение,
//	|	ВЫБОР
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА Ценности.СтатьяРасходов
//	|		КОГДА НЕ СтатьиАктивовПассивов.Ссылка ЕСТЬ NULL
//	|			ТОГДА Ценности.СтатьяПрочихАктивов
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК СтатьяРасходов,
//	|	ВЫБОР
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА Ценности.АналитикаРасходов
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК АналитикаРасходов,
//	|	ВЫБОР
//	|		КОГДА НЕ СтатьиАктивовПассивов.Ссылка ЕСТЬ NULL
//	|			ТОГДА Ценности.АналитикаПрочихАктивов
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК АналитикаАктивовПассивов,
//	|	ВЫБОР
//	|		КОГДА Ценности.КорректировкаПоСогласованиюСторон
//	|			ТОГДА Ценности.ДокументКорректировкиПриобретения
//	|		ИНАЧЕ Ценности.ДокументПриобретения
//	|	КОНЕЦ КАК ДокументПоступленияРасходов,
//	|	Ценности.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	|	Ценности.НаправлениеДеятельности КАК НаправлениеДеятельности,
//	|	Ценности.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (&ТипыНоменклатурыТовар, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(Назначения.ВидДеятельностиНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
//	|						ТОГДА Назначения.ВидДеятельностиНДС
//	|					КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВидЦенностиНДС, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС),
//	|						                                                           ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА))
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
//	|					КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					      И Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		ИНАЧЕ
//	|			ВЫБОР
//	|				КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|					  И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|				ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|			КОНЕЦ
//	|	КОНЕЦ КАК ВидДеятельностиНДС,
//	|	
//	|	0 КАК Стоимость,
//	|	0 КАК СтоимостьБезНДС,
//	|	ВЫБОР
//	|		КОГДА СуммыДокументов.БазаНДСРегл <> 0
//	|			ТОГДА СуммыДокументов.БазаНДСРегл
//	|		ИНАЧЕ СуммыДокументов.СуммаБезНДСРегл
//	|	КОНЕЦ КАК СтоимостьРегл,
//	|	СуммыДокументов.СуммаНДСРегл КАК НДСРегл,
//	|	0 КАК ПостояннаяРазница,
//	|	0 КАК ВременнаяРазница,
//	|	ВЫБОР
//	|		КОГДА &УправленческийУчетОрганизаций
//	|			ТОГДА СуммыДокументов.СуммаНДСУпр
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК НДСУпр,
//	|	
//	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК НалогообложениеНДС,
//	|	НЕОПРЕДЕЛЕНО КАК ДокументРеализации,
//	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяОтраженияРасходов,
//	|	НЕОПРЕДЕЛЕНО КАК АналитикаОтраженияРасходов,
//	|	ЛОЖЬ КАК РасчетПартий,
//	|	ДАТАВРЕМЯ(1,1,1) КАК ПериодБазы,
//	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация
//	|
//	|ИЗ
//	|	#Ценности КАК Ценности
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.Номенклатура КАК СпрНоменклатура
//	|	ПО
//	|		Ценности.Номенклатура = СпрНоменклатура.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
//	|	ПО
//	|		Ценности.СтатьяРасходов = СтатьиРасходов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
//	|	ПО
//	|		Ценности.СтатьяПрочихАктивов = СтатьиАктивовПассивов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.Назначения КАК Назначения
//	|	ПО
//	|		Ценности.Назначение = Назначения.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ВтСуммыДокументовВВалютахУчета КАК СуммыДокументов
//	|	ПО
//	|		Ценности.Ссылка = СуммыДокументов.Ссылка
//	|		И Ценности.ИдентификаторСтроки = СуммыДокументов.ИдентификаторСтроки
//	|
//	|ГДЕ
//	|	Ценности.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
//	|	И ВЫБОР
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (&ТипыНоменклатурыТовар, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(Назначения.ВидДеятельностиНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
//	|						ТОГДА Назначения.ВидДеятельностиНДС
//	|					КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВидЦенностиНДС, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС),
//	|						                                                           ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА))
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
//	|					КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					      И Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		ИНАЧЕ
//	|			ВЫБОР
//	|				КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|					  И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|				ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|			КОНЕЦ
//	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
//	|	И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьтоваров)
//	|	И ЕСТЬNULL(СуммыДокументов.СуммаНДСРегл, 0) <> 0
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	// Формирование движений по ОС и НМА
//	|ВЫБРАТЬ
//	|	Ценности.Ссылка КАК Регистратор,
//	|	Ценности.Период КАК Период,
//	|	Ценности.Организация КАК Организация,
//	|	Ценности.ПодразделениеУчета КАК Подразделение,
//	|	ВЫБОР
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА Ценности.СтатьяРасходов
//	|		КОГДА НЕ СтатьиАктивовПассивов.Ссылка ЕСТЬ NULL
//	|			ТОГДА Ценности.СтатьяПрочихАктивов
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК СтатьяРасходов,
//	|	ВЫБОР
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА Ценности.АналитикаРасходов
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК АналитикаРасходов,
//	|	ВЫБОР
//	|		КОГДА НЕ СтатьиАктивовПассивов.Ссылка ЕСТЬ NULL
//	|			ТОГДА Ценности.АналитикаПрочихАктивов
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК АналитикаАктивовПассивов,
//	|	ВЫБОР
//	|		КОГДА Ценности.КорректировкаПоСогласованиюСторон
//	|			ТОГДА Ценности.ДокументКорректировкиПриобретения
//	|		ИНАЧЕ Ценности.ДокументПриобретения
//	|	КОНЕЦ КАК ДокументПоступленияРасходов,
//	|	Ценности.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	|	Ценности.НаправлениеДеятельности КАК НаправлениеДеятельности,
//	|	Ценности.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ВЫБОР
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВидЦенностиНДС, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС),
//	|						                                                           ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА))
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
//	|					КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					      И Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		ИНАЧЕ
//	|			ВЫБОР
//	|				КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|					  И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|				ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|			КОНЕЦ
//	|	КОНЕЦ КАК ВидДеятельностиНДС,
//	|
//	|	0 КАК Стоимость,
//	|	0 КАК СтоимостьБезНДС,
//	|	ВЫБОР
//	|		КОГДА СуммыДокументов.БазаНДСРегл <> 0
//	|			ТОГДА СуммыДокументов.БазаНДСРегл
//	|		ИНАЧЕ СуммыДокументов.СуммаБезНДСРегл
//	|	КОНЕЦ КАК СтоимостьРегл,
//	|	СуммыДокументов.СуммаНДСРегл КАК НДСРегл,
//	|	0 КАК ПостояннаяРазница,
//	|	0 КАК ВременнаяРазница,
//	|	ВЫБОР
//	|		КОГДА &УправленческийУчетОрганизаций
//	|			ТОГДА СуммыДокументов.СуммаНДСУпр
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК НДСУпр,
//	|	
//	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК НалогообложениеНДС,
//	|	НЕОПРЕДЕЛЕНО КАК ДокументРеализации,
//	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяОтраженияРасходов,
//	|	НЕОПРЕДЕЛЕНО КАК АналитикаОтраженияРасходов,
//	|	ЛОЖЬ КАК РасчетПартий,
//	|	ДАТАВРЕМЯ(1,1,1) КАК ПериодБазы,
//	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация
//	|
//	|ИЗ
//	|	#Ценности КАК Ценности
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
//	|	ПО
//	|		Ценности.СтатьяРасходов = СтатьиРасходов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
//	|	ПО
//	|		Ценности.СтатьяПрочихАктивов = СтатьиАктивовПассивов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ВтСуммыДокументовВВалютахУчета КАК СуммыДокументов
//	|	ПО
//	|		Ценности.Ссылка = СуммыДокументов.Ссылка
//	|		И Ценности.ИдентификаторСтроки = СуммыДокументов.ИдентификаторСтроки
//	|
//	|ГДЕ
//	|	Ценности.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
//	|	И (НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL 
//	|		ИЛИ НЕ СтатьиАктивовПассивов.Ссылка ЕСТЬ NULL)
//	|	И ВЫБОР
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВидЦенностиНДС, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС),
//	|						                                                           ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА))
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
//	|					КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					      И Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		ИНАЧЕ
//	|			ВЫБОР
//	|				КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|					  И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|				ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|			КОНЕЦ
//	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
//	|	И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьтоваров)
//	|	И ЕСТЬNULL(СуммыДокументов.СуммаНДСРегл, 0) <> 0
//	|";
//	
//#КонецОбласти
//	
//#Область ДанныеОснованийСчетовФактур
//	
//	ПолныеИменаСчетовФактур = Новый Массив;
//	ПолныеИменаСчетовФактур.Добавить("Документ.СчетФактураПолученный");
//	ПолныеИменаСчетовФактур.Добавить("Документ.СчетФактураПолученныйНалоговыйАгент");
//	ИдентификаторыСчетовФактур = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(ПолныеИменаСчетовФактур);
//	
//	Запрос.УстановитьПараметр("ИдентификаторСчетФактураПолученный", ИдентификаторыСчетовФактур["Документ.СчетФактураПолученный"]);
//	Запрос.УстановитьПараметр("ИдентификаторСчетФактураНалоговыйАгентПолученный", ИдентификаторыСчетовФактур["Документ.СчетФактураПолученныйНалоговыйАгент"]);
//	
//	ТекстЗапросаДанныеОснованийСчетовФактур = 
//	"ВЫБРАТЬ
//	|	Ценности.Ссылка КАК Регистратор,
//	|	Ценности.Период КАК Период,
//	|	ВЫБОР 
//	|		КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
//	|			ТОГДА &ИдентификаторСчетФактураНалоговыйАгентПолученный
//	|		ИНАЧЕ &ИдентификаторСчетФактураПолученный
//	|	КОНЕЦ КАК ТипСчетаФактуры,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (&ТипыНоменклатурыТовар)
//	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.ГруппаФинансовогоУчета.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары))
//	|		КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТоварыНалоговыйАгент)
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА СтатьиРасходов.ВидЦенностиНДС
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
//	|	КОНЕЦ КАК ВидЦенности,
//	|	ВЫБОР 
//	|		КОГДА НЕ СпрВидыЗапасов.ТипЗапасов ЕСТЬ NULL
//	|			ТОГДА СпрВидыЗапасов.ТипЗапасов
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В(&ТипыНоменклатурыТовар) 
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
//	|	КОНЕЦ КАК ТипЗапасов,
//	|	Ценности.СтавкаНДС КАК СтавкаНДС,
//	|	Ценности.НомерГТД КАК НомерГТД,
//	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка) КАК КодТНВЭД,
//	|	ВЫБОР
//	|		КОГДА СуммыДокументов.СуммаНДС < 0
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК УменьшениеСуммы,
//	|
//	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСчетаФактурыКомиссионера,
//	|	НЕОПРЕДЕЛЕНО КАК ПокупательКомиссионногоТовара,
//	|	НЕОПРЕДЕЛЕНО КАК СчетФактураВыданныйКомиссионером,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (&ТипыНоменклатурыТовар, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(Назначения.ВидДеятельностиНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
//	|						ТОГДА Назначения.ВидДеятельностиНДС
//	|					КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL И СтатьиРасходов.ВариантРаспределенияРасходовРегл <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров) 
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВидЦенностиНДС, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС),
//	|						                                                           ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА))
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
//	|					КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					      И Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		ИНАЧЕ
//	|			ВЫБОР
//	|				КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|					  И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|				ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|			КОНЕЦ
//	|	КОНЕЦ КАК ВидДеятельностиНДС,
//	|	ВЫБОР КОГДА ЕСТЬNULL(Назначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
//	|		ТОГДА Назначения.НаправлениеДеятельности
//	|		ИНАЧЕ Ценности.НаправлениеДеятельности
//	|	КОНЕЦ КАК НаправлениеДеятельности,
//	|
//	|	СУММА(СуммыДокументов.СуммаБезНДС) КАК СуммаБезНДС,
//	|	СУММА(СуммыДокументов.СуммаНДС) КАК СуммаНДС,
//	|	СУММА(СуммыДокументов.СуммаБезНДСРегл) КАК СуммаБезНДСРегл,
//	|	СУММА(СуммыДокументов.БазаНДСРегл) КАК БазаНДСРегл,
//	|	СУММА(СуммыДокументов.СуммаНДСРегл) КАК СуммаНДСРегл,
//	|
//	|	МАКСИМУМ(Ценности.Период) КАК Дата,
//	|	МАКСИМУМ(Ценности.НалогообложениеНДС) КАК НалогообложениеНДС,
//	|	МАКСИМУМ(СуммыДокументов.ВалютаДокумента) КАК Валюта,
//	|	МАКСИМУМ(Ценности.Организация) КАК Организация,
//	|	МАКСИМУМ(Ценности.Подразделение) КАК Подразделение,
//	|	МАКСИМУМ(Ценности.Контрагент) КАК Контрагент,
//	|	МАКСИМУМ(Ценности.Договор) КАК Договор,
//	|	МАКСИМУМ(Ценности.Грузоотправитель) КАК Грузоотправитель,
//	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
//	|	ЛОЖЬ КАК ЭтоВозврат,
//	|	МАКСИМУМ(Ценности.ИсправлениеОшибок) КАК ИсправлениеОшибок,
//	|	МАКСИМУМ(Ценности.КорректировкаПоСогласованиюСторон) КАК КорректировкаПоСогласованиюСторон,
//	|	МАКСИМУМ(ВЫБОР
//	|				КОГДА Ценности.ИсправлениеОшибок ИЛИ Ценности.КорректировкаПоСогласованиюСторон
//	|					ТОГДА Ценности.ДокументПриобретения
//	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|			КОНЕЦ) КАК КорректируемыйДокумент
//	|ИЗ
//	|	#Ценности КАК Ценности
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
//	|	ПО
//	|		Ценности.СтатьяРасходов = СтатьиРасходов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
//	|	ПО
//	|		Ценности.СтатьяПрочихАктивов = СтатьиАктивовПассивов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.Номенклатура КАК СпрНоменклатура
//	|	ПО
//	|		Ценности.Номенклатура = СпрНоменклатура.Ссылка
//	|	
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.Назначения КАК Назначения
//	|	ПО
//	|		Ценности.Назначение = Назначения.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Справочник.ВидыЗапасов КАК СпрВидыЗапасов
//	|	ПО
//	|		Ценности.ВидЗапасов = СпрВидыЗапасов.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ВтСуммыДокументовВВалютахУчета КАК СуммыДокументов
//	|	ПО
//	|		Ценности.Ссылка = СуммыДокументов.Ссылка
//	|		И Ценности.ИдентификаторСтроки = СуммыДокументов.ИдентификаторСтроки
//	|
//	|ГДЕ
//	|	Ценности.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Ценности.Ссылка,
//	|	Ценности.Период,
//	|	ВЫБОР
//	|		КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
//	|			ТОГДА &ИдентификаторСчетФактураНалоговыйАгентПолученный
//	|		ИНАЧЕ &ИдентификаторСчетФактураПолученный
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (&ТипыНоменклатурыТовар)
//	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.ГруппаФинансовогоУчета.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары))
//	|		КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТоварыНалоговыйАгент)
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
//	|			ТОГДА СтатьиРасходов.ВидЦенностиНДС
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
//	|	КОНЕЦ,
//	|	ВЫБОР 
//	|		КОГДА НЕ СпрВидыЗапасов.ТипЗапасов ЕСТЬ NULL
//	|			ТОГДА СпрВидыЗапасов.ТипЗапасов
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В(&ТипыНоменклатурыТовар) 
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
//	|	КОНЕЦ,
//	|	Ценности.СтавкаНДС,
//	|	Ценности.НомерГТД,
//	|	ВЫБОР
//	|		КОГДА СуммыДокументов.СуммаНДС < 0
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(СпрНоменклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (&ТипыНоменклатурыТовар, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(Назначения.ВидДеятельностиНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
//	|						ТОГДА Назначения.ВидДеятельностиНДС
//	|					КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL И СтатьиРасходов.ВариантРаспределенияРасходовРегл <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров) 
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВидЦенностиНДС, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС),
//	|						                                                           ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА))
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
//	|						  И ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
//	|					КОГДА ЕСТЬNULL(СтатьиРасходов.ВариантРаздельногоУчетаНДС, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
//	|					КОГДА Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					      И Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|					ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|				КОНЕЦ
//	|		ИНАЧЕ
//	|			ВЫБОР
//	|				КОГДА Ценности.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
//	|					  И Ценности.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС)
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
//	|				ИНАЧЕ Ценности.ВидДеятельностиНДС
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ВЫБОР КОГДА ЕСТЬNULL(Назначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
//	|		ТОГДА Назначения.НаправлениеДеятельности
//	|		ИНАЧЕ Ценности.НаправлениеДеятельности
//	|	КОНЕЦ
//	|";
//	
//#КонецОбласти

//	ТекстыШаблоновОтражения = Новый Структура();
//	Если ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений("НДСПредъявленный", Регистры) Тогда
//		ТекстыШаблоновОтражения.Вставить("НДСПредъявленный", ТекстЗапросаНДСПредъявленный);
//	КонецЕсли;
//	Если ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений("ПартииПрочихРасходов", Регистры) Тогда
//		ТекстыШаблоновОтражения.Вставить("ПартииПрочихРасходов", ТекстЗапросаПартииПрочихРасходов);
//	КонецЕсли;
//	Если ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений("ДанныеОснованийСчетовФактур", Регистры) Тогда
//		ТекстыШаблоновОтражения.Вставить("ДанныеОснованийСчетовФактур", ТекстЗапросаДанныеОснованийСчетовФактур);
//	КонецЕсли;
//	Если ТекстыШаблоновОтражения.Количество() > 0 Тогда
//		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Запрос.Параметры.Ссылка);
//		МенеджерДокумента.ИнициализироватьВтСуммыДокументовВВалютахУчета(Запрос, ТекстыЗапроса);
//	КонецЕсли;
//	ТекстыЗапросовДанныхДокумента = Новый Структура("Ценности", ТекстЦенности);
//	ПроведениеСерверУТ.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента);
//	//-- Локализация
//	
//КонецПроцедуры

//#КонецОбласти
